import Navbar from "./components/navbar";
import Discuss from "./components/discuss";
import Ref from "./components/ref";
import Image from "next/image";

export default function Home() {
  return (
    <main className="flex min-h-screen flex-col items-center">
      <Navbar />
      <div className="flex-initial p-4 w-full mt-16">
        <article className="text-pretty">
          <h1 className="text-[#5C3D20] font-bold text-lg border-b-4 border-[#F3541C] py-4">การพัฒนาระบบอินเทอร์เน็ตของสรรพสิ่งสําหรับการวินิจฉัยภาวะซึมเศร้าและโรคซึมเศร้า และพัฒนาแนวทางการรักษาผู้ป่วยซึมเศร้าแบบองค์รวมอย่างมีส่วนร่วมด้วยระบบปัญญาประดิษฐ์</h1>
        </article>
        <div className="flex justify-center w-full my-4">
          <Image src="/example.png" alt="" height={500} width={400} />
        </div>
        <Discuss topic="บทคัดย่อ" text="โครงการนี้มุ่งพัฒนาต้นแบบระบบอินเทอร์เน็ตของสรรพสิ่งเพื่อตรวจวัดและเก็บบันทึกข้อมูลที่เกี่ยวกับภาวะซึมเศร้าและโรคซึมเศร้า ซึ่งจะช่วยให้การตรวจวินิจฉัยภาวะซึมเศร้าและโรคซึมเศร้าเป็นไปได้อย่างง่ายดายและรวดเร็ว นอกจากนี้ โครงการยังมุ่งสร้างองค์ความรู้พื้นฐานเกี่ยวกับการใช้ข้อมูลจากระบบดังกล่าวเพื่อเพิ่มคุณค่าในด้านสุขภาพจิต โดยการออกแบบและสร้างปัญญาประดิษฐ์ที่สามารถเก็บบันทึกข้อมูลปัจจัยต่างๆ ที่เกี่ยวข้องกับการรักษาโรคซึมเศร้าได้ รวมทั้งพัฒนาต้นแบบปัญญาประดิษฐ์ที่ออกแบบแนวทางการรักษาผู้ป่วยซึมเศร้าแบบองค์รวมที่สอดคล้องกับความต้องการของผู้ป่วย ญาติ และแพทย์ ซึ่งจะช่วยให้การดูแลและการรักษาโรคซึมเศร้าเป็นไปอย่างมีประสิทธิภาพและตอบโจทย์ต่อความต้องการของผู้ที่เกี่ยวข้องได้อย่างเหมาะสม." />
        <p className="text-sm py-2"><strong>keywords: </strong>Depression, ML(machine learning), IOT</p>
        <Discuss topic="บทนำ" text="ในยุคปัจจุบันที่เทคโนโลยีดิจิทัลเข้ามามีบทบาทสำคัญในทุกมิติของชีวิต การพัฒนาระบบอินเทอร์เน็ตของสรรพสิ่งเพื่อตอบโจทย์ปัญหาสุขภาพจิตกลายเป็นสิ่งจำเป็นอย่างยิ่ง โครงการนี้จึงได้ถูกออกแบบมาเพื่อพัฒนาต้นแบบระบบที่สามารถตรวจวัดและเก็บบันทึกข้อมูลที่เกี่ยวข้องกับภาวะซึมเศร้าและโรคซึมเศร้า ซึ่งจะช่วยให้การตรวจวินิจฉัยโรคเป็นไปได้ง่ายและรวดเร็วยิ่งขึ้น
นอกจากนี้ โครงการยังมุ่งมั่นที่จะสร้างองค์ความรู้พื้นฐานจากข้อมูลที่ได้จากระบบเพื่อส่งเสริมสุขภาวะด้านสุขภาพจิตให้ดียิ่งขึ้น โดยการออกแบบและสร้างปัญญาประดิษฐ์ที่สามารถบันทึกข้อมูลปัจจัยต่าง ๆ ที่มีผลต่อการรักษาโรคซึมเศร้าได้ เพื่อตอบสนองความต้องการของผู้ป่วย ญาติ และแพทย์อย่างมีประสิทธิภาพ นอกจากนี้ ยังมีการพัฒนาต้นแบบปัญญาประดิษฐ์เพื่อออกแบบแนวทางการรักษาแบบองค์รวมที่สามารถปรับให้เข้ากับสถานการณ์และความต้องการของแต่ละบุคคลได้ ซึ่งจะช่วยให้การดูแลรักษาโรคซึมเศร้าเป็นไปอย่างเหมาะสมและมีประสิทธิผลมากขึ้น." />
        <Discuss topic="วัสดุและวิธีการ" text="การพัฒนาต้นแบบระบบอินเทอร์เน็ตของสรรพสิ่งสำหรับตรวจวัดและเก็บบันทึกข้อมูล: การดำเนินงานนี้เป็นหลักในการออกแบบและพัฒนาต้นแบบที่สามารถตรวจจับและบันทึกข้อมูลที่เกี่ยวข้องกับภาวะซึมเศร้า ใช้อุปกรณ์ IoT และ smartwatch ในการเก็บข้อมูลการเต้นของหัวใจ และการบันทึกใบหน้าโดยใช้กล้องบันทึกภาพและซอฟต์แวร์ต่างๆ สำหรับการประมวลผลข้อมูล
การวิเคราะห์ข้อมูลโดยใช้การเรียนรู้ของเครื่อง (Machine Learning): หลังจากที่ข้อมูลถูกบันทึกไว้, ข้อมูลจะถูกนำมาวิเคราะห์โดยใช้โมเดลการเรียนรู้ของเครื่องเพื่อพัฒนาความสามารถในการทำนายภาวะซึมเศร้าจากข้อมูลที่ได้รับ โดยใช้เทคนิคต่างๆ เช่น haarcascade_frontalface_default.xml สำหรับการตรวจจับใบหน้า." />
        <div className="flex items-center justify-center flex-col sm:flex-row w-full my-4 gap-4">
          <Image src="/gadget.png" alt="" height={500} width={400} />
          <Image src="/trainning.png" alt="" height={500} width={400} />
        </div>
        <Discuss topic="สรุป" text="ผลการทดลองใช้ต้นแบบระบบอินเทอร์เน็ตของสรรพสิ่งสำหรับตรวจวัดและเก็บบันทึกข้อมูล: รวมถึงการใช้งานอุปกรณ์ต่างๆ เช่น Smart watch ในการเก็บข้อมูลการเต้นของหัวใจและใบหน้า ผลจากการทดลองได้แสดงให้เห็นว่าข้อมูลสามารถบันทึกและส่งออกมาในรูปแบบไฟล์ csv ได้.
การวิเคราะห์ข้อมูลร่วมกับผลการตรวจวินิจฉัยภาวะซึมเศร้าและโรคซึมเศร้า: การวิเคราะห์ข้อมูลทำให้ทราบถึงประสิทธิภาพของโมเดลการเรียนรู้ของเครื่อง ซึ่งผลการทดลองแสดงใน Confusion Matrix ได้ชี้ให้เห็นถึงระดับความแม่นยำที่สูง.
ผลการนำมาใช้พัฒนาต้นแบบโปรแกรมสำหรับตรวจสอบความเคลื่อนไหวบนใบหน้าของแต่ละอารมณ์: โดยใช้ yolo v5 ในการตรวจจับการเคลื่อนไหวของใบหน้า ผลที่ได้จากการนำโมเดลการเรียนรู้ของเครื่องที่พัฒนาขึ้นมาใช้จริง มีความแม่นยำอยู่ที่ 0.65-0.94 ขึ้นอยู่กับปัจจัยต่างๆ เช่น ระดับแสงสว่างและคุณภาพของกล้องที่ใช้งาน.
การสร้างเครือข่ายความร่วมมือ: มีการเผยแพร่และถ่ายทอดเทคโนโลยีการวิจัยนี้ผ่านงานนิทรรศการของมหาวิทยาลัย และการสร้างเครือข่ายความร่วมมือกับผู้ที่สนใจ." />
        <div className="flex justify-center w-full my-4">
          <Image src="/result.png" alt="" height={500} width={400} />
        </div>
        <Ref />
      </div>
    </main>
  );
}
